# BuiltInFailures.SkylightFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..SkylightFailures Members
BuiltInFailures..::..SkylightFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..SkylightFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MinSkylightWidthImperial | The minimum skylight width is 8 inches. |
| MinSkylightWidthMetric | The minimum skylight width is 203.2 millimeters. |

# See Also
BuiltInFailures..::..SkylightFailures Class
Autodesk.Revit.DB Namespace